# DividedSurfaceCoverFaceCompletely Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceCoverFaceCompletely Property
ParameterTypeId Class See Also
---
"Cover face completely"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceCoverFaceCompletely { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCoverFaceCompletely As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceCoverFaceCompletely {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace